// Практическая работа 2 Задание 4
// Изменить программу сделанную в задании 3 практической работы 1:
// Вынести алгоритм в отдельную функцию,
// куда в качестве аргумента необходимо передовать лямбда функцию, сравнения двух чисел, изменяя данную функцию,
// должная быть возможность получать информацию о самых коротких либо самых длинных словах.
// Аналогичным способом в функцию должна передаваться функция отбора слов

// Практическая работа 1 задание 3
// Найди последний символ в первом самом коротком слове с четным числом символов в строке

fun taskFour()
{
    print("Введите строку:\n> ")
    var str: String? = readLine()

    if(str != null)
    {

    }
    else
    {
        println("Error: значение равно null")
    }
}

// Основной алгоритм, в него передается алгоритм сравнения двух символов?
fun taskFourFun()
{

}